In [1]:
import pandas as pd

In [3]:
#empty dataframe
empty=pd.DataFrame()
print(empty)

Empty DataFrame
Columns: []
Index: []

In [7]:
#1 d dataframe
df1=pd.DataFrame(['a','b','c'])
df1

   0
0  a
1  b
2  c

In [12]:
#2 d dataframe
df2=pd.DataFrame([['a','b','c'],[1,5,2],[6,3,5]])
df2

   0  1  2
0  a  b  c
1  1  5  2
2  6  3  5

In [13]:
df3=pd.DataFrame([['a','b','c'],[1,5,2],[6,3,5,8]])
df3

   0  1  2    3
0  a  b  c  NaN
1  1  5  2  NaN
2  6  3  5  8.0

In [18]:
#creating data frame using dictionary
df4=pd.DataFrame({'ID':[1,2,3,4,5],'Name':['Charu','Sakthi','Sunaina','Priyanka','Lenora']})
df4

   ID      Name
0   1     Charu
1   2    Sakthi
2   3   Sunaina
3   4  Priyanka
4   5    Lenora

In [20]:
df5=pd.DataFrame([{'a':1,'b':5},{'a':34,'b':3}])
df5

    a  b
0   1  5
1  34  3

In [21]:
df5=pd.DataFrame([{'a':1,'b':5},{'a':34,'b':3,'c':87}])
df5

    a  b     c
0   1  5   NaN
1  34  3  87.0

In [25]:
#creating data frame using series and dictionary
dict_series=({'Id':pd.Series([1,2,3,4,5]),'Name':pd.Series(['Charu','Sakthi','Manu','Vayuna','Priyanka'])})
df6=pd.DataFrame(dict_series)
df6

   Id      Name
0   1     Charu
1   2    Sakthi
2   3      Manu
3   4    Vayuna
4   5  Priyanka